In [2]:
import pandas as pd
import pandas as pd
from sqlalchemy import create_engine
%load_ext sql

In [3]:
# Create a connection to the PostgreSQL database
engine=create_engine('postgresql+psycopg2://postgres:password@localhost:5432/medsupply')
connection=engine.connect()
print("Connected:", connection.closed == False)

Connected: True

In [4]:
# check connection using SQL magic command
%sql postgresql+psycopg2://postgres:password@localhost:5432/medsupply

'Connected: postgres@medsupply'

Check Column Name Length and Escaped Characters

In [6]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'customers'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('customer_id', 11, 'customer_id'),
 ('customer_name', 13, 'customer_name'),
 ('facility_type', 13, 'facility_type'),
 ('pic_name', 8, 'pic_name'),
 ('pic_phone', 9, 'pic_phone'),
 ('total_transaction', 17, 'total_transaction')]

In [7]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'master_products'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('product_code', 12, 'product_code'),
 ('product_name', 12, 'product_name'),
 ('product_type', 12, 'product_type'),
 ('stock_available', 15, 'stock_available'),
 ('inden_lead_time_days', 20, 'inden_lead_time_days'),
 ('supplier_cost', 13, 'supplier_cost')]

In [8]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'transactions_item'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
8 rows affected.

[('transaction_id', 14, 'transaction_id'),
 ('product_type', 12, 'product_type'),
 ('product_code', 12, 'product_code'),
 ('product_name', 12, 'product_name'),
 ('unit_price', 10, 'unit_price'),
 ('quantity', 8, 'quantity'),
 ('item_total', 10, 'item_total'),
 ('inden_status', 12, 'inden_status')]

In [9]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'transactions_main'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('transaction_id', 14, 'transaction_id'),
 ('customer_id', 11, 'customer_id'),
 ('order_date', 10, 'order_date'),
 ('delivery_date', 13, 'delivery_date'),
 ('grand_total', 11, 'grand_total'),
 ('invoice_status', 14, 'invoice_status')]

In [10]:
%%sql

SELECT *
FROM customers
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('RS001', 'PT Halimah Sihotang Hospital', 'Hospital', 'Wirda Marbun', '0811560614', Decimal('34')),
 ('RS002', 'PT Laksmiwati Thamrin (Persero) Tbk Hospital', 'Hospital', 'Tgk. Victoria Nashiruddin, S.Pt', '+62 (139) 410-6026', Decimal('41')),
 ('RS003', 'PD Habibi (Persero) Tbk Hospital', 'Hospital', 'Lulut Mardhiyah', '+62 (65) 008-9607', Decimal('27')),
 ('RS004', 'Perum Gunarto Santoso Tbk Hospital', 'Hospital', 'Cornelia Maryadi', '(0075) 927 8207', Decimal('14')),
 ('RS005', 'PT Hidayanto Hospital', 'Hospital', 'Kamal Kurniawan', '(047) 551 5900', Decimal('9'))]

In [11]:
%%sql

SELECT *
FROM master_products
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('MED-C001', 'Syringe 10ml', 'Consumable', 4893, 30, Decimal('41523233')),
 ('MED-C002', 'N95 Mask', 'Consumable', 959, 7, Decimal('1424286')),
 ('MED-C003', 'Catheter 16G', 'Consumable', 4548, 7, Decimal('3696961')),
 ('MED-C004', 'Nitrile Gloves L', 'Consumable', 3067, 14, Decimal('41772748')),
 ('MED-C005', 'Gauze 10x10cm', 'Consumable', 815, 7, Decimal('40903772'))]

In [13]:
%%sql

SELECT *
FROM transactions_item
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'Service', 'SVC-J002', 'MRI Annual Service', Decimal('43276270'), 104, Decimal('4500732078'), 'Yes (21 days)'),
 ('TRX002', 'Service', 'SVC-J010', 'Endoscope Training', Decimal('89553379'), 386, Decimal('34567604362'), 'Yes (21 days)'),
 ('TRX003', 'Device', 'MED-D119', 'Getinge Anesthesia', Decimal('59996963'), 413, Decimal('24778745687'), 'Yes (30 days)'),
 ('TRX003', 'Device', 'MED-D107', 'Zoll Defibrillator', Decimal('7533268'), 36, Decimal('271197647'), 'Yes (21 days)'),
 ('TRX003', 'Service', 'SVC-J004', 'Defib Training', Decimal('32409783'), 356, Decimal('11537882752'), 'Yes (7 days)')]

In [14]:
%%sql

SELECT *
FROM transactions_main
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'KL012', datetime.datetime(2025, 8, 12, 0, 0), datetime.datetime(2025, 2, 7, 0, 0), Decimal('86241611'), 'Completed'),
 ('TRX002', 'KL005', datetime.datetime(2025, 1, 13, 0, 0), datetime.datetime(2025, 10, 7, 0, 0), Decimal('20511512'), 'Sent to Tax'),
 ('TRX003', 'RS030', datetime.datetime(2025, 9, 30, 0, 0), datetime.datetime(2026, 1, 5, 0, 0), Decimal('23558781'), 'Customer Confirmation'),
 ('TRX004', 'RS013', datetime.datetime(2025, 7, 6, 0, 0), datetime.datetime(2025, 1, 20, 0, 0), Decimal('61995760'), 'Customer Confirmation'),
 ('TRX005', 'RS012', datetime.datetime(2025, 8, 21, 0, 0), datetime.datetime(2025, 3, 18, 0, 0), Decimal('48911176'), 'Customer Confirmation')]

After Modification

In [5]:
%%sql

SELECT *
FROM transactions_main
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'KL012', datetime.date(2025, 8, 12), datetime.date(2025, 2, 7), Decimal('86241611'), 'Completed'),
 ('TRX002', 'KL005', datetime.date(2025, 1, 13), datetime.date(2025, 10, 7), Decimal('20511512'), 'Sent to Tax'),
 ('TRX003', 'RS030', datetime.date(2025, 9, 30), datetime.date(2026, 1, 5), Decimal('23558781'), 'Customer Confirmation'),
 ('TRX004', 'RS013', datetime.date(2025, 7, 6), datetime.date(2025, 1, 20), Decimal('61995760'), 'Customer Confirmation'),
 ('TRX005', 'RS012', datetime.date(2025, 8, 21), datetime.date(2025, 3, 18), Decimal('48911176'), 'Customer Confirmation')]

In [12]:
%%sql

SELECT *
FROM transactions_item
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'Service', 'SVC-J002', 'MRI Annual Service', Decimal('43276270'), 104, Decimal('4500732078'), 'Yes', 21),
 ('TRX002', 'Service', 'SVC-J010', 'Endoscope Training', Decimal('89553379'), 386, Decimal('34567604362'), 'Yes', 21),
 ('TRX003', 'Device', 'MED-D119', 'Getinge Anesthesia', Decimal('59996963'), 413, Decimal('24778745687'), 'Yes', 30),
 ('TRX003', 'Device', 'MED-D107', 'Zoll Defibrillator', Decimal('7533268'), 36, Decimal('271197647'), 'Yes', 21),
 ('TRX003', 'Service', 'SVC-J004', 'Defib Training', Decimal('32409783'), 356, Decimal('11537882752'), 'Yes', 7)]

In [16]:
%%sql

SELECT 
    mp.product_code,
    mp.product_name,
    mp.inden_lead_time_days,
    mp.stock_available,
    ti.inden_est_time_days
FROM master_products as mp
JOIN transactions_item as ti USING (product_code)
WHERE ti.inden_flag = 'Yes'
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('SVC-J002', 'MRI Annual Service', 21, 1686, 21),
 ('SVC-J010', 'Endoscope Training', 21, 4341, 21),
 ('MED-D119', 'Getinge Anesthesia', 30, 4721, 30),
 ('MED-D107', 'Zoll Defibrillator', 21, 980, 21),
 ('SVC-J004', 'Defib Training', 7, 154, 7)]